; domain
(define (domain abyssus-base)
    (:requirements :strips :typing :negative-preconditions :equality :disjunctive-preconditions :quantified-preconditions :conditional-effects :fluents :action-costs)
    (:types
        locatable location - object
        rov sample - locatable
        pressure-sensitive - sample
        pressure-stabilizer docking-station - location
    )

    (:predicates
        (at ?x - locatable ?l - location)
        (carrying ?r - rov ?s - sample)
        (connected ?from - location ?to - location)
        (narrow-connected ?from - location ?to - location)
        (stabilized ?s - sample)
        (small-robot ?r - rov)
    )

    (:functions
        (battery-level ?r - rov)
        (total-cost)
        (capacity ?r - rov)
    )

    (:action move
        :parameters (?r - rov ?from - location ?to - location)
        :precondition 
        (and 
            (at ?r ?from) 
            (or
                (connected ?from ?to) 
                (and
                    (narrow-connected ?from ?to)
                    (small-robot ?r)
                )
            )
            (not (= ?from ?to))
            (>= (battery-level ?r) 2)
        )
        :effect (and (at ?r ?to) (not (at ?r ?from)) (decrease (battery-level ?r) 2) (increase (total-cost) 2))
    )

    (:action pickup
        :parameters (?r - rov ?s - sample ?l - location)
        :precondition (and (at ?r ?l) (at ?s ?l) (>= (battery-level ?r) 1) (>= (capacity ?r) 1))
        :effect (and (carrying ?r ?s) (not (at ?s ?l)) (decrease (battery-level ?r) 1) (increase (total-cost) 1) (decrease (capacity ?r) 1))
    )

    (:action drop
        :parameters (?r - rov ?s - sample ?l - location)
        :precondition (and (at ?r ?l) (carrying ?r ?s) (>= (battery-level ?r) 1))
        :effect (and (not (carrying ?r ?s)) (at ?s ?l) (decrease (battery-level ?r) 1) (increase (total-cost) 1) (increase (capacity ?r) 1))
    )

    (:action stabilize
        :parameters (?l - pressure-stabilizer)
        :precondition (and (exists (?r - rov ?adj - location) (and (at ?r ?adj) (connected ?adj ?l))) (exists (?s - pressure-sensitive) (and (at ?s ?l) (not (stabilized ?s)))))
        :effect (and 
            (forall (?s - pressure-sensitive) 
                (when (at ?s ?l) (stabilized ?s))
            )
            (increase (total-cost) 3)
        )
    )

    (:action recharge
        :parameters (?r - rov ?l - docking-station)
        :precondition (and (at ?r ?l) (<= (battery-level ?r) 20))
        :effect (and (assign (battery-level ?r) 20) (increase (total-cost) 4))
    )
    
)

; problem
(define (problem t1)
    (:domain abyssus-base)
    (:objects
        rov1 rov2 rov3 rov4 - rov
        s1 s2 s6 - sample
        s3 s4 s5 - pressure-sensitive
        wing-alpha wing-beta transfer-zone decompression-chamber bio-vault - location
        docking_station - docking-station
        pressure_stabilizer - pressure-stabilizer
    )
    (:init
        (narrow-connected transfer-zone wing-alpha)
        (narrow-connected wing-alpha transfer-zone)
        (connected transfer-zone wing-beta)
        (connected wing-beta transfer-zone)
        (connected transfer-zone docking_station)
        (connected docking_station transfer-zone)
        (connected transfer-zone decompression-chamber)
        (connected decompression-chamber transfer-zone)
        (connected decompression-chamber pressure_stabilizer)
        (connected pressure_stabilizer decompression-chamber)
        (connected decompression-chamber bio-vault)
        (connected bio-vault decompression-chamber)
        (connected pressure_stabilizer bio-vault)
        (connected bio-vault pressure_stabilizer)

        (at rov1 docking_station)
        (at rov2 docking_station)
        (at rov3 docking_station)
        (at rov4 docking_station)
        (small-robot rov1)
        (small-robot rov3)
        (small-robot rov4)
        (at s1 wing-alpha)
        (at s2 wing-alpha)
        (at s3 wing-alpha)
        (at s4 wing-alpha) 
        (at s5 wing-beta)
        (at s6 wing-beta)

        (= (battery-level rov1) 20)
        (= (battery-level rov2) 20)
        (= (battery-level rov3) 20)
        (= (battery-level rov4) 20)
        (= (capacity rov1) 1)
        (= (capacity rov2) 3)
        (= (capacity rov3) 1)
        (= (capacity rov4) 1)
        (= (total-cost) 0)
    )
    (:goal
        (and
            (forall (?s - sample)
                (at ?s bio-vault)
            )
            (forall (?s - pressure-sensitive)
                (stabilized ?s)
            )
        )
    )
    (:metric minimize (total-cost))
)

; plan
1. (move rov1 docking_station transfer-zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 20 to 18
   goals met: 0 of 2
2. (move rov1 transfer-zone wing-alpha)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 wing-alpha)
   changed: (battery-level rov1) from 18 to 16
   goals met: 0 of 2
3. (pickup rov1 s4 wing-alpha)
   deleted: (at s4 wing-alpha)
   added: (carrying rov1 s4)
   changed: (battery-level rov1) from 16 to 15, (capacity rov1) from 1 to 0
   goals met: 0 of 2
4. (move rov1 wing-alpha transfer-zone)
   deleted: (at rov1 wing-alpha)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 15 to 13
   goals met: 0 of 2
5. (move rov1 transfer-zone decompression-chamber)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 13 to 11
   goals met: 0 of 2
6. (move rov1 decompression-chamber pressure_stabilizer)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 pressure_stabilizer)
   changed: (battery-level rov1) from 11 to 9
   goals met: 0 of 2
7. (drop rov1 s4 pressure_stabilizer)
   deleted: (carrying rov1 s4)
   added: (at s4 pressure_stabilizer)
   changed: (battery-level rov1) from 9 to 8, (capacity rov1) from 0 to 1
   goals met: 0 of 2
8. (move rov1 pressure_stabilizer decompression-chamber)
   deleted: (at rov1 pressure_stabilizer)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 8 to 6
   goals met: 0 of 2
9. (move rov1 decompression-chamber transfer-zone)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 6 to 4
   goals met: 0 of 2
10. (move rov1 transfer-zone docking_station)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 docking_station)
   changed: (battery-level rov1) from 4 to 2
   goals met: 0 of 2
11. (recharge rov1 docking_station)
   changed: (battery-level rov1) from 2 to 20
   goals met: 0 of 2
12. (move rov1 docking_station transfer-zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 20 to 18
   goals met: 0 of 2
13. (move rov1 transfer-zone wing-alpha)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 wing-alpha)
   changed: (battery-level rov1) from 18 to 16
   goals met: 0 of 2
14. (pickup rov1 s3 wing-alpha)
   deleted: (at s3 wing-alpha)
   added: (carrying rov1 s3)
   changed: (battery-level rov1) from 16 to 15, (capacity rov1) from 1 to 0
   goals met: 0 of 2
15. (move rov1 wing-alpha transfer-zone)
   deleted: (at rov1 wing-alpha)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 15 to 13
   goals met: 0 of 2
16. (move rov1 transfer-zone decompression-chamber)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 13 to 11
   goals met: 0 of 2
17. (stabilize pressure_stabilizer)
   added: (stabilized s4)
   goals met: 0 of 2
18. (move rov1 decompression-chamber pressure_stabilizer)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 pressure_stabilizer)
   changed: (battery-level rov1) from 11 to 9
   goals met: 0 of 2
19. (drop rov1 s3 pressure_stabilizer)
   deleted: (carrying rov1 s3)
   added: (at s3 pressure_stabilizer)
   changed: (battery-level rov1) from 9 to 8, (capacity rov1) from 0 to 1
   goals met: 0 of 2
20. (move rov1 pressure_stabilizer decompression-chamber)
   deleted: (at rov1 pressure_stabilizer)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 8 to 6
   goals met: 0 of 2
21. (move rov1 decompression-chamber transfer-zone)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 6 to 4
   goals met: 0 of 2
22. (move rov1 transfer-zone docking_station)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 docking_station)
   changed: (battery-level rov1) from 4 to 2
   goals met: 0 of 2
23. (recharge rov1 docking_station)
   changed: (battery-level rov1) from 2 to 20
   goals met: 0 of 2
24. (move rov1 docking_station transfer-zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 20 to 18
   goals met: 0 of 2
25. (move rov1 transfer-zone decompression-chamber)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 18 to 16
   goals met: 0 of 2
26. (move rov1 decompression-chamber pressure_stabilizer)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 pressure_stabilizer)
   changed: (battery-level rov1) from 16 to 14
   goals met: 0 of 2
27. (pickup rov1 s4 pressure_stabilizer)
   deleted: (at s4 pressure_stabilizer)
   added: (carrying rov1 s4)
   changed: (battery-level rov1) from 14 to 13, (capacity rov1) from 1 to 0
   goals met: 0 of 2
28. (move rov1 pressure_stabilizer bio-vault)
   deleted: (at rov1 pressure_stabilizer)
   added: (at rov1 bio-vault)
   changed: (battery-level rov1) from 13 to 11
   goals met: 0 of 2
29. (drop rov1 s4 bio-vault)
   deleted: (carrying rov1 s4)
   added: (at s4 bio-vault)
   changed: (battery-level rov1) from 11 to 10, (capacity rov1) from 0 to 1
   goals met: 0 of 2
30. (move rov1 bio-vault decompression-chamber)
   deleted: (at rov1 bio-vault)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 10 to 8
   goals met: 0 of 2
31. (move rov1 decompression-chamber transfer-zone)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 8 to 6
   goals met: 0 of 2
32. (move rov1 transfer-zone docking_station)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 docking_station)
   changed: (battery-level rov1) from 6 to 4
   goals met: 0 of 2
33. (recharge rov1 docking_station)
   changed: (battery-level rov1) from 4 to 20
   goals met: 0 of 2
34. (move rov1 docking_station transfer-zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 20 to 18
   goals met: 0 of 2
35. (move rov1 transfer-zone wing-beta)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 wing-beta)
   changed: (battery-level rov1) from 18 to 16
   goals met: 0 of 2
36. (pickup rov1 s5 wing-beta)
   deleted: (at s5 wing-beta)
   added: (carrying rov1 s5)
   changed: (battery-level rov1) from 16 to 15, (capacity rov1) from 1 to 0
   goals met: 0 of 2
37. (move rov1 wing-beta transfer-zone)
   deleted: (at rov1 wing-beta)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 15 to 13
   goals met: 0 of 2
38. (move rov1 transfer-zone decompression-chamber)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 13 to 11
   goals met: 0 of 2
39. (move rov1 decompression-chamber pressure_stabilizer)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 pressure_stabilizer)
   changed: (battery-level rov1) from 11 to 9
   goals met: 0 of 2
40. (drop rov1 s5 pressure_stabilizer)
   deleted: (carrying rov1 s5)
   added: (at s5 pressure_stabilizer)
   changed: (battery-level rov1) from 9 to 8, (capacity rov1) from 0 to 1
   goals met: 0 of 2
41. (move rov1 pressure_stabilizer decompression-chamber)
   deleted: (at rov1 pressure_stabilizer)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 8 to 6
   goals met: 0 of 2
42. (stabilize pressure_stabilizer)
   added: (stabilized s3) (stabilized s5)
   goals met: 1 of 2
43. (move rov1 decompression-chamber transfer-zone)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 6 to 4
   goals met: 1 of 2
44. (move rov1 transfer-zone docking_station)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 docking_station)
   changed: (battery-level rov1) from 4 to 2
   goals met: 1 of 2
45. (recharge rov1 docking_station)
   changed: (battery-level rov1) from 2 to 20
   goals met: 1 of 2
46. (move rov1 docking_station transfer-zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 20 to 18
   goals met: 1 of 2
47. (move rov1 transfer-zone decompression-chamber)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 18 to 16
   goals met: 1 of 2
48. (move rov1 decompression-chamber pressure_stabilizer)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 pressure_stabilizer)
   changed: (battery-level rov1) from 16 to 14
   goals met: 1 of 2
49. (pickup rov1 s3 pressure_stabilizer)
   deleted: (at s3 pressure_stabilizer)
   added: (carrying rov1 s3)
   changed: (battery-level rov1) from 14 to 13, (capacity rov1) from 1 to 0
   goals met: 1 of 2
50. (move rov1 pressure_stabilizer bio-vault)
   deleted: (at rov1 pressure_stabilizer)
   added: (at rov1 bio-vault)
   changed: (battery-level rov1) from 13 to 11
   goals met: 1 of 2
51. (drop rov1 s3 bio-vault)
   deleted: (carrying rov1 s3)
   added: (at s3 bio-vault)
   changed: (battery-level rov1) from 11 to 10, (capacity rov1) from 0 to 1
   goals met: 1 of 2
52. (move rov1 bio-vault decompression-chamber)
   deleted: (at rov1 bio-vault)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 10 to 8
   goals met: 1 of 2
53. (move rov1 decompression-chamber transfer-zone)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 8 to 6
   goals met: 1 of 2
54. (move rov1 transfer-zone docking_station)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 docking_station)
   changed: (battery-level rov1) from 6 to 4
   goals met: 1 of 2
55. (recharge rov1 docking_station)
   changed: (battery-level rov1) from 4 to 20
   goals met: 1 of 2
56. (move rov1 docking_station transfer-zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 20 to 18
   goals met: 1 of 2
57. (move rov1 transfer-zone decompression-chamber)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 18 to 16
   goals met: 1 of 2
58. (move rov1 decompression-chamber pressure_stabilizer)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 pressure_stabilizer)
   changed: (battery-level rov1) from 16 to 14
   goals met: 1 of 2
59. (pickup rov1 s5 pressure_stabilizer)
   deleted: (at s5 pressure_stabilizer)
   added: (carrying rov1 s5)
   changed: (battery-level rov1) from 14 to 13, (capacity rov1) from 1 to 0
   goals met: 1 of 2
60. (move rov1 pressure_stabilizer bio-vault)
   deleted: (at rov1 pressure_stabilizer)
   added: (at rov1 bio-vault)
   changed: (battery-level rov1) from 13 to 11
   goals met: 1 of 2
61. (drop rov1 s5 bio-vault)
   deleted: (carrying rov1 s5)
   added: (at s5 bio-vault)
   changed: (battery-level rov1) from 11 to 10, (capacity rov1) from 0 to 1
   goals met: 1 of 2
62. (move rov1 bio-vault decompression-chamber)
   deleted: (at rov1 bio-vault)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 10 to 8
   goals met: 1 of 2
63. (move rov1 decompression-chamber transfer-zone)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 8 to 6
   goals met: 1 of 2
64. (move rov1 transfer-zone docking_station)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 docking_station)
   changed: (battery-level rov1) from 6 to 4
   goals met: 1 of 2
65. (recharge rov1 docking_station)
   changed: (battery-level rov1) from 4 to 20
   goals met: 1 of 2
66. (move rov1 docking_station transfer-zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 20 to 18
   goals met: 1 of 2
67. (move rov1 transfer-zone wing-alpha)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 wing-alpha)
   changed: (battery-level rov1) from 18 to 16
   goals met: 1 of 2
68. (pickup rov1 s2 wing-alpha)
   deleted: (at s2 wing-alpha)
   added: (carrying rov1 s2)
   changed: (battery-level rov1) from 16 to 15, (capacity rov1) from 1 to 0
   goals met: 1 of 2
69. (move rov1 wing-alpha transfer-zone)
   deleted: (at rov1 wing-alpha)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 15 to 13
   goals met: 1 of 2
70. (move rov1 transfer-zone decompression-chamber)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 13 to 11
   goals met: 1 of 2
71. (move rov1 decompression-chamber bio-vault)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 bio-vault)
   changed: (battery-level rov1) from 11 to 9
   goals met: 1 of 2
72. (drop rov1 s2 bio-vault)
   deleted: (carrying rov1 s2)
   added: (at s2 bio-vault)
   changed: (battery-level rov1) from 9 to 8, (capacity rov1) from 0 to 1
   goals met: 1 of 2
73. (move rov1 bio-vault decompression-chamber)
   deleted: (at rov1 bio-vault)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 8 to 6
   goals met: 1 of 2
74. (move rov1 decompression-chamber transfer-zone)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 6 to 4
   goals met: 1 of 2
75. (move rov1 transfer-zone docking_station)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 docking_station)
   changed: (battery-level rov1) from 4 to 2
   goals met: 1 of 2
76. (recharge rov1 docking_station)
   changed: (battery-level rov1) from 2 to 20
   goals met: 1 of 2
77. (move rov1 docking_station transfer-zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 20 to 18
   goals met: 1 of 2
78. (move rov1 transfer-zone decompression-chamber)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 18 to 16
   goals met: 1 of 2
79. (move rov1 decompression-chamber transfer-zone)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 16 to 14
   goals met: 1 of 2
80. (move rov1 transfer-zone wing-alpha)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 wing-alpha)
   changed: (battery-level rov1) from 14 to 12
   goals met: 1 of 2
81. (pickup rov1 s1 wing-alpha)
   deleted: (at s1 wing-alpha)
   added: (carrying rov1 s1)
   changed: (battery-level rov1) from 12 to 11, (capacity rov1) from 1 to 0
   goals met: 1 of 2
82. (move rov1 wing-alpha transfer-zone)
   deleted: (at rov1 wing-alpha)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 11 to 9
   goals met: 1 of 2
83. (drop rov1 s1 transfer-zone)
   deleted: (carrying rov1 s1)
   added: (at s1 transfer-zone)
   changed: (battery-level rov1) from 9 to 8, (capacity rov1) from 0 to 1
   goals met: 1 of 2
84. (pickup rov1 s1 transfer-zone)
   deleted: (at s1 transfer-zone)
   added: (carrying rov1 s1)
   changed: (battery-level rov1) from 8 to 7, (capacity rov1) from 1 to 0
   goals met: 1 of 2
85. (move rov1 transfer-zone docking_station)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 docking_station)
   changed: (battery-level rov1) from 7 to 5
   goals met: 1 of 2
86. (recharge rov1 docking_station)
   changed: (battery-level rov1) from 5 to 20
   goals met: 1 of 2
87. (move rov1 docking_station transfer-zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 20 to 18
   goals met: 1 of 2
88. (move rov1 transfer-zone decompression-chamber)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 18 to 16
   goals met: 1 of 2
89. (move rov1 decompression-chamber bio-vault)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 bio-vault)
   changed: (battery-level rov1) from 16 to 14
   goals met: 1 of 2
90. (drop rov1 s1 bio-vault)
   deleted: (carrying rov1 s1)
   added: (at s1 bio-vault)
   changed: (battery-level rov1) from 14 to 13, (capacity rov1) from 0 to 1
   goals met: 1 of 2
91. (move rov1 bio-vault decompression-chamber)
   deleted: (at rov1 bio-vault)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 13 to 11
   goals met: 1 of 2
92. (move rov1 decompression-chamber transfer-zone)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 11 to 9
   goals met: 1 of 2
93. (move rov1 transfer-zone wing-beta)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 wing-beta)
   changed: (battery-level rov1) from 9 to 7
   goals met: 1 of 2
94. (pickup rov1 s6 wing-beta)
   deleted: (at s6 wing-beta)
   added: (carrying rov1 s6)
   changed: (battery-level rov1) from 7 to 6, (capacity rov1) from 1 to 0
   goals met: 1 of 2
95. (move rov1 wing-beta transfer-zone)
   deleted: (at rov1 wing-beta)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 6 to 4
   goals met: 1 of 2
96. (move rov1 transfer-zone docking_station)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 docking_station)
   changed: (battery-level rov1) from 4 to 2
   goals met: 1 of 2
97. (recharge rov1 docking_station)
   changed: (battery-level rov1) from 2 to 20
   goals met: 1 of 2
98. (move rov1 docking_station transfer-zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer-zone)
   changed: (battery-level rov1) from 20 to 18
   goals met: 1 of 2
99. (move rov1 transfer-zone decompression-chamber)
   deleted: (at rov1 transfer-zone)
   added: (at rov1 decompression-chamber)
   changed: (battery-level rov1) from 18 to 16
   goals met: 1 of 2
100. (move rov1 decompression-chamber bio-vault)
   deleted: (at rov1 decompression-chamber)
   added: (at rov1 bio-vault)
   changed: (battery-level rov1) from 16 to 14
   goals met: 1 of 2
101. (drop rov1 s6 bio-vault)
   deleted: (carrying rov1 s6)
   added: (at s6 bio-vault)
   changed: (battery-level rov1) from 14 to 13, (capacity rov1) from 0 to 1
   goals met: 2 of 2
